import React from 'react';

export const Intro: React.FC = () => (
  <div>
    <h2>Introduction</h2>
    <p>
      මේ හරහා ඕනෑම ගුරුවරයෙකුට තමන්ගේම  උපකාරක පන්තියක් පවත්වාගෙන යා හැකිය.
      මෙහිදී ගුරවරයා විසින් record කරන ලද video files අක්ෂර.lk වෙබ් අඩවියට upload කල යුතු අතර
      සිසුන් විසින්  මේවා එකින් එක නැරඹිය හැකිය.
    </p>
    <p>
      Free Videos:
      <br />
      ඕනෑම සිසුවෙකුට මෙම video නැරඹිය හැකිය. කිසිදු ගෙවීමක් අවශ්‍ය නොවේ.
      (ගුරුවරුන් විසින් තමන්ගේ පාඨමාලාව පිලිබඳ සාරාංශයක් ඉතා ආකර්ශනීය ලෙස මෙමගින්  upload කල හැකිය.)
    </p>
    <p>
      Paid Videos:
      <br />
      මෙම video නැරඹීමට නම් අපගේ වෙබ් අඩවියට online ගෙවීමක් සිදුකල යුතුය. Video එකෙහි අන්තර්ගතය හා කාලය අනුව ගෙවිය යුතු මුදල ගුරුවරයාට තනිවම  ඇතුලත්  කල හැකිය. සෑම  මසකම අවසානයේ  ගුරුවරයාගේ මුදල  ඔහුගේ බැංකු ගිණුමට බැර වේ.
    </p>
  </div>
);
